SELECT *
FROM BaseCode
WHERE GroupCode IN (
    -- 학사
    'CZ01', 'CZ02', 'CZ04', 'CZ12', 'CZ14', 'CZ21',

    -- 입학
    'SA01', 'SA31', 'SB01', 'SB02', 'SB34',

    -- 학적
    'SB03', 'SB06', 'SB08', 'SB52', 'SB11',
    'SB26', 'SB37', 'SB38', 'SB51', 'SB42',

    -- 수업
    'SC01', 'SC04', 'SC14', 'SD02', 'SE05',
    'SF01', 'SD10', 'SM01',

    -- 장학
    'SH01', 'SH02', 'SH07', 'SH08', 'SH16', 'DA02',

    -- 등록
    'SI01', 'SI04', 'SI06', 'SI08', 'SI09',
    'SI16', 'SI17', 'SI18', 'SI20',

    -- 지역
    'CA01', 'CA02',

    -- 인사
    'A400', 'A401', 'A402', 'A403', 'A404',
    'A405', 'A410', 'A411', 'A419', 'A422',
    'A424', 'A428', 'A433', 'A437', 'A445',

    -- 자산
    'A201', 'A303', 'A304',

    -- 구매
    'A204', 'A208',

    -- 결재
    'A109', 'A110', 'A113',

    -- 통계/교육부/공통
    'C009', 'C011', 'C101', 'CZ15', 'CZ16', 'CZ17',

    -- 기부/발전기금
    'SQ00', 'SQ10', 'SQ11',

    -- 기타
    'SA59'


,'A501'
,'A502'
,'A506'
,'A512'
,'A519'
)
ORDER BY GroupCode, SubCode;

